{
  "subject": "Marathi grammar",
  "topic": "nam",
  "wikipedia": {
    "title": "Polish grammar",
    "summary": "The grammar of the Polish language is complex and characterized by a high degree of inflection, and has relatively free word order, although the dominant arrangement is subject–verb–object (SVO). There commonly are no articles (although this has been a subject of academic debate), and there is frequent dropping of subject pronouns. Distinctive features include the different treatment of masculine personal nouns in the plural, and the complex grammar of numerals and quantifiers.",
    "content": "The grammar of the Polish language is complex and characterized by a high degree of inflection, and has relatively free word order, although the dominant arrangement is subject–verb–object (SVO). There commonly are no articles (although this has been a subject of academic debate), and there is frequent dropping of subject pronouns. Distinctive features include the different treatment of masculine personal nouns in the plural, and the complex grammar of numerals and quantifiers.\n\n\n== Regular morphological alternation ==\n\nCertain regular or common alternations apply across the Polish inflectional system, affecting the morphology of nouns, adjectives, verbs, and other parts of speech. Some of these result from the restricted distribution of the vowels i and y, and from the voicing rules for consonants in clusters and at the end of words. Otherwise, the main changes are the following:\n\nvowel alternations, arising from the historical development of certain vowels, which cause vowel changes in some words depending on whether the syllable is closed or open, or whether the following consonant is soft or hard;\nconsonant changes caused by certain endings (such as the -ie of the locative case, and the -i of the masculine personal plural), which historically entailed palatalization of the preceding consonant, and now produce a number of different changes depending on which consonant is involved.\n\n\n== Nouns ==\n\nPolish retains the Old Slavic system of cases for nouns, pronouns, and adjectives. There are seven cases: nominative (mianownik), genitive (dopełniacz), dative (celownik), accusative (biernik), instrumental (narzędnik), locative (miejscownik), and vocative (wołacz).\n\n\n=== Number ===\nPolish has two number classes: singular and plural.\nIt used to also have the dual number, but it vanished around the 15th century. It survived only in a few relicts:\n\nbody parts that naturally come in pairs have synchronically irregular plural and other forms\noko (\"eye\") – pl. oczy, genitive plural oczu, instrumental plural regular oczami or irregular oczyma; but not in the sense of \"drop of fat on a liquid\", which is declined regularly\nręka (\"hand, arm\") – pl. ręce, locative singular regular ręce or irregular ręku, instrumental plural regular rękami or irregular rękoma\nucho (\"ear\") – pl. uszy, genitive plural uszu, instrumental plural regular uszami or irregular uszyma; but not in the sense of \"a handle (of a jug or a kettle, etc.)\", which is declined regularly\ncertain proverbs, e.g. Mądrej głowie dość dwie słowie (lit. \"two words are enough for a wise head\"), with dual dwie słowie (modern dwa słowa)\n\n\n=== Gender ===\nFor true nouns (not for adjectives), there are three cases that always have the same ending in the plural, regardless of gender or declension class: dative plural in -om, instrumental plural in -ami or -mi, and locative plural in -ach; the only apparent exception being nouns that are in fact inflected as previously dual nouns, ex. rękoma instrumental plural of ręka \"hand\".\n\n\n==== Inflection ====\nThere are three main genders (rodzaje): masculine (męski), feminine (żeński) and neuter (nijaki). Masculine nouns are further divided into personal (męskoosobowy), animate (męskożywotny), and inanimate (męskorzeczowy) categories. Personal and animate nouns are distinguished from inanimate nouns in the accusative singular; for the latter the accusative is identical to the nominative. In the plural, the masculine personal nouns are distinguished from all others, which collapse into one non-masculine personal gender (niemęskoosobowy).\nThe following tables show this distinction using as examples the nouns mężczyzna 'man' (masc. personal), pies 'dog' (masc. animate), stół 'table' (masc. inanimate), kobieta 'woman' (feminine), okno 'window' (neuter). The following table presents examples of how a determiner ten/ta/to (\"this\") agrees with nouns of different genders in the nominative and the accusative, both singular and plural. Adjectives inflect similarly to this determiner.\n\nFor verbs, the distinction is only important for past forms in the plural, as in the table below:\n\nThe numeral dwa (\"two\"), on the other hand, behaves differently, merging masculine non-personal with neuter, but not with feminine:\n\n\n==== Morphological endings ====\nGender can usually be inferred from the ending of a noun.\nMasculine:\n\nmasculine nouns typically end in a consonant\nsome nouns, describing people, end in -a, specifically:\nall nouns ending in -sta, equivalent to English \"-ist\", e.g. artysta (\"artist\"), kapitalista (\"capitalist\"), konserwatysta (\"conservative\"), socjalista (\"socialist\")\nall nouns ending in -nauta, equivalent to English \"-naut\", e.g.  argonauta (\"argonaut\"), astronauta (\"astronaut\"), kosmonauta (\"cosmonaut\")\nlast names\nfirst names Barnaba, Bonawentura, also Kuba (diminutive of Jakub)\nemotionally charged nicknames, e.g. beksa (\"crybaby\"), łamaga, niezdara, oferma (all three of which mean \"a clumsy person\")\nsome other nouns, e.g. satelita (\"satellite\"), wojewoda (\"voivode\"); hrabia (\"count\") and sędzia (\"judge\") – both partially declined like adjectives\nsome personal names end in -o, e.g. Horeszko, Kościuszko; those decline in singular like feminine nouns ending in -a\nsome nouns, which were originally adjectives, end in -i and -y; those decline in singular like adjectives\nFeminine:\n\nfeminine nouns typically end in -a\nsome nouns end in a soft or hardened consonant:\nall abstract nouns ending in -ść, e.g. miłość (\"love\"), nieśmiałość (\"shyness\"), zawiść (\"envy\"), etc.\nsome concrete nouns ending in -ść: kiść (\"bunch\"), kość (\"bone\"), maść (\"ointment\"), ość (\"fishbone\"), przepaść (\"chasm\"), wieść (\"news\")\n-b: głąb (\"depth\")\n-c: moc (\"power\"), noc (\"night\"), pomoc (\"help\"), przemoc (\"violence\"), równonoc (\"equinox\"), Wielkanoc (\"Easter\"), wszechmoc (\"omnipotence\")\n-cz: Bydgoszcz, ciecz (\"liquid\"), dzicz (\"wilderness\"), klacz (\"mare\"), kokorycz (\"corydalis\"), rzecz (\"thing\"), smycz (\"leash\")\n-ć: brać (\"company\"), chuć (\"lust\"), jać (\"yat\"), mać (archaic for \"mother\"), płeć (\"sex, gender\"), sieć (\"net\")\n-dź: czeladź (a collective term for servants of one master during the Middle Ages(pl)\"), gołoledź (\"black ice\"), krawędź (\"edge\"), łódź (\"boat\"), miedź (\"copper\"), odpowiedź (\"answer\"), powódź (\"flood\"), spowiedź (\"confession\"), wypowiedź (\"utterance\"), zapowiedź (\"announcement\")\n-j: kolej (\"railway\")\n-l: kąpiel (\"bath\"), myśl (\"thought\"), sól (\"salt\")\n-ń: baśń (\"fable\"), czerń (\"the colour black, blackness\"), czerwień (\"the colour red, redness\"), dłoń (\"palm\"), goleń (\"shin\"), jaźń (\"self, ego\"), jesień (\"autumn\"), kieszeń (\"pocket\"), krtań (\"larynx\"), otchłań (\"abyss\"), pieczeń (\"roasted meat\"), pieśń (\"song\"), pleśń (\"mould\"), przestrzeń (\"space\"), przyjaźń (\"friendship\"), przystań (\"haven\"), skroń (\"temple\"), waśń (\"feud\"), woń (\"odour\"), zieleń (\"the colour green, greenness\")\n-p: Gołdap\n-rz: macierz (\"matrix\"), twarz (\"face\")\n-sz: mysz (\"mouse\"), wesz (\"louse\")\n-ś: Białoruś (\"Belarus\"), gęś (\"goose\"), oś (\"axis\"), pierś (\"breast\"), Ruś (\"Ruthenia\"), wieś (\"village\")\n-ź: gałąź (\"branch\"), rzeź (\"slaughter\")\n-ż: grabież (\"pillage\"), młodzież (\"youth\"), odzież (\"clothing\"), podaż (\"supply\"), sprzedaż (\"sale\"), straż (\"guard\"), uprząż (\"harness\")\n-w: brew (\"eyebrow\"), brukiew (\"rutabaga\"), marchew (\"carrot\"), konew (\"jug\"), krew (\"blood\"), rukiew (\"watercress\"), rzodkiew (\"radish\"), żagiew (\"torch\")\nwords ending in -ini are feminine, e.g. bogini (\"goddess\"); also pani (\"Mrs\")\nfeminine last names ending in a consonant are invariable\nNeuter:\n\nneuter nouns typically end in -o\nverbal nouns, which are always neuter, end in -e, e.g. jedzenie, śpiewanie, etc.\ndiminutives ending in -ę are always neuter, e.g. źrebię (\"foal\"), dziecię (\"child\")\nLatin loanwords ending in -um : invariable in the singular, declinable in the plural by removing the -um ending and replacing it by neuter plural endings ; the genitive plural is in -ów contrary to other neuters that have no ending → muzeum, muzea (N. pl.), muzeów (G. pl.)\nloanwords ending in -i are neuter and invariable, e.g. kiwi, Brunei, Burundi\nacronyms ending in a vowel (in pronunciation), e.g. BMW [bɛɛmˈvu]; if an acronym is native, its gender may also be equal to the gender of the noun in the full version of the acronym\n\n\n==== Semantic membership ====\nThe distinction between personal, animate and inanimate nouns within masculine nouns is largely semantic, although not always.\nPersonal nouns are comprised by human nouns such as mężczyzna 'man' or sędzia 'male judge', personal names of men, as well as the noun bóg 'male god' and proper names of male gods (e.g. Rod \"Rod\", Jowisz \"Jupiter\").\nAnimate nouns are largely comprised by animals such as pies (\"dog\") or pawian (\"baboon\"), many members from other life domains, as well as a number of objects associated with human activity. On the morphological level however, such nouns are only partially similar to animate nouns, having their accusative identical to their genitive only in the singular. \nSome examples :\n\nnames of fruit, e.g. ananas (\"pineapple\"), banan (\"banana\")\nnames of fungi, bacteria, viruses, e.g. borowik (\"cep\"), grzyb (\"mushroom\"), wirus (\"virus\"), gronkowiec (\"staphylococcus\")\nnames of consumer goods and brands, e.g. mercedes (\"Mercedes car\"), Nikon (as in Mam Nikona – \"I have a Nikon\"), papieros (\"cigarette\")\nnames of currency, e.g. dolar (\"dollar\"), funt (\"pound\")\nnames of dances, e.g. polonez (\"polonaise\")\nsome loanwords related to information technology, e.g. blog, komputer (\"computer\")\nnouns related to human or human-like referents, e.g. nieboszczyk, trup (both of which mean \"corpse\"), robot (\"robot\"), wisielec (\"the body of a hanged person\"), duch (\"ghost\")\nContrary to fungi and bacteria, most plant names of masculine gender are inanimate, e.g. żonkil (\"daffodil\"), hiacynt (\"hyacinth\"), dąb (\"oak\"), cis (\"yew tree\"), which are all inanimate. The noun goździk (\"carnation\") is an exception as a masculine animate. Not all technological loanwords are animate either, e.g. inanimate modem, telefon (\"telephone, cellphone\"), and tranzystor (\"transistor\"). Robot can be treated as animate or inanimate.\nIt is common for personal masculine nouns to change gender to inanimate to create semantic neologisms, for example edytor (\"editor\", pl. ci edytorzy) and edytor (tekstu) (\"word processor software\", pl. te edytory).\nFor non-living objects that represent humans (e.g. in games), personal masculine nouns usually change gender to animate; for example, the word król (\"king\"), which is masculine-personal when referring to a monarch (pl. ci królowie), becomes masculine-animate when referring to the playing card or the chess piece (pl. te króle).\nThere are also a few pairs of homographs that completely change their meaning depending on their gender. Examples are:\n\nHomographs that differ only by their gender can also occur in some Polish place names; for example, the town of Ostrów (Wielkopolski) is masculine, while the town of Ostrów (Mazowiecka) is feminine.\n\n\n=== Declension ===\nTypical declension patterns are as follows:\n\nklub (\"club\"; an inanimate masculine noun) – N/A klub, G klubu, D klubowi, I klubem, L/V klubie. Plural: N/A/V kluby, G klubów, D klubom, I klubami, L klubach.\nmapa (\"map\"; a feminine noun) – N mapa, G mapy, D/L mapie, A mapę, I mapą, V mapo. Plural: N/A/V mapy, G map, D mapom, I mapami, L mapach.\nmięso (\"meat\"; a neuter noun) – N/A/V mięso, G mięsa, D mięsu, I mięsem, L mięsie. Plural: N/A/V mięsa, G mięs, D mięsom, I mięsami, L mięsach.\n\nA common deviation from the above patterns is that many masculine nouns have genitive singular in -a rather than -u. This includes all personal and animate masculines (ending in a consonant). Also masculine animate nouns have accusative singular equal to the genitive singular (in -a). Masculine personal nouns also have accusative plural equal to genitive plural, and often have nominative plural in -i.\n\n\n== Adjectives ==\n\nAdjectives agree with the noun they modify in terms of gender, number and case. They are declined according to the following pattern (dumny means \"proud\"):\n\nmasculine singular: N/V dumny, G dumnego, D dumnemu, A dumny (for inanimate nouns)/dumnego (animate), I/L dumnym\nfeminine singular: N/V dumna, G/D/L dumnej, A/I dumną\nneuter singular: N/V/A dumne, G/D/I/L as masculine\nplural: N/V/A dumne (but for masculine personal nouns N/V dumni A dumnych), G/L dumnych, D dumnym, I dumnymi\n\nFor a table showing the declension of Polish adjectival surnames, ending in -ski/-ska or -cki/-cka, see Declension of adjectival surnames.\nMost short adjectives have a comparative form in -szy or -iejszy, and a superlative obtained by prefixing naj- to the comparative.\nFor adjectives that do not have these forms, the words bardziej (\"more\") and najbardziej (\"most\") are used before the adjective to make comparative and superlative phrases.\nAdverbs are formed from adjectives with the ending ie, or in some cases -o. Comparatives of adverbs are formed (where they exist) with the ending -iej. Superlatives have the prefix naj- as for adjectives.\n\n\n== Pronouns ==\nThe personal pronouns of Polish (nominative forms) are ja (\"I\"), ty (\"you\", singular, familiar), on (\"he\", or \"it\" corresponding to masculine nouns), ona (\"she\", or \"it\" corresponding to feminine nouns), ono (\"it\" corresponding to neuter nouns), my (\"we\"), wy (\"you\", plural, familiar), oni (\"they\", corresponding to a masculine personal group – see Noun syntax below), one (\"they\" in other cases; group where there are only girls/women).\nInstead of polite second-person pronouns, Polish uses the nouns pan (\"gentleman, Mr\"), pani (\"lady, Mrs\") and their plurals panowie, panie as courtesy titles (see T-V distinction in Polish). The mixed-sex plural is państwo.  All second-person pronouns and courtesy titles are often capitalized for politeness, in letters etc.\n\nSubject pronouns (except for the polite second-person pronouns) can be dropped if the meaning is clear and they are not emphasized. Sometimes there are alternative forms available for a given personal pronoun in a given case:\n\nthere may be a form beginning with n-, used after prepositions (for example, the accusative of ona is nią after a preposition rather than ją);\nthere may be a clitic form, used when unstressed, but not after prepositions (such as mi as the dative of ja, an alternative to mnie).\nThe reflexive pronoun for all persons and numbers is się.\nThe possessive adjectives (also used as possessive pronouns) derived from the personal pronouns are mój, twój, jego (m., n.)/jej (f.); nasz, wasz, ich. There is also a reflexive possessive swój. The polite second-person pronouns have possessives identical to the genitives of the corresponding nouns, although there is a possessive adjective pański corresponding to pan.\nThe demonstrative pronoun, also used as a demonstrative adjective, is ten (feminine ta, neuter to, masculine personal plural  ci, other plural te). The prefix tam- can be added to emphasize a more distant referent (\"that\" as opposed to \"this\").\nInterrogative pronouns are kto (\"who\") and co (\"what\"); these also provide the pronouns ktoś/coś (\"someone/something\"), ktokolwiek/cokolwiek (\"anyone/anything\"), nikt/nic (\"no one/nothing\").\nThe usual relative pronoun is który (declined like an adjective). However, when the antecedent is also a pronoun, the relative pronoun used is kto or co (as in ten kto \"he who\" and to co \"that which\"). The word który also means \"which\" as an interrogative pronoun and adjective.\nThe pronoun and adjective wszystek means \"all\". It is used most commonly in the plural (wszyscy means \"everyone\"), and in the neuter singular (wszystko) to mean \"everything\". The pronoun and adjective każdy means \"each, every\", while żaden means \"no, none\".\nFor full information on the declension of the above pronouns, see Pronouns in the article on Polish morphology.\nWhen the referent of a pronoun is a person of unspecified sex, the masculine form of the pronoun is generally used. When the referent is a thing or idea that does not correspond to any specific noun, it is treated as neuter.\n\n\n== Numbers and quantifiers ==\nPolish has a complex system of numerals and related quantifiers, with special rules for their inflection, for the case of the governed noun, and for verb agreement with the resulting noun phrase.\nThe basic numerals are 0 zero, 1 jeden, 2 dwa, 3 trzy, 4 cztery, 5 pięć, 6 sześć, 7 siedem, 8 osiem, 9 dziewięć, 10 dziesięć, 11 jedenaście, 12 dwanaście, 13 trzynaście, 14 czternaście, 15 piętnaście, 16 szesnaście, 17 siedemnaście, 18 osiemnaście, 19 dziewiętnaście, 20 dwadzieścia, 30 trzydzieści, 40 czterdzieści, 50 pięćdziesiąt, 60 sześćdziesiąt, 70 siedemdziesiąt, 80 osiemdziesiąt, 90 dziewięćdziesiąt, 100 sto, 200 dwieście, 300 trzysta, 400 czterysta, 500 pięćset, 600 sześćset, 700 siedemset, 800 osiemset, 900 dziewięćset.\nThese numerals are inflected for case, and also to some extent for gender. For details of their inflection, see Numbers and quantifiers in the article on Polish morphology.\nThousand is tysiąc, treated as a noun (so 2000 is dwa tysiące, etc.). Million is milion, billion (meaning a thousand million) is miliard, a million million is bilion, a thousand million million is biliard, and so on (i.e., the long scale is used).\nCompound numbers are constructed similarly as in English (for example, 91,234 is dziewięćdziesiąt jeden tysięcy dwieście trzydzieści cztery).\nWhen a numeral modifies a noun, the numeral takes the expected case, but the noun may not; also the gender and number of the resulting noun phrase may not correspond to that of the noun. The following rules apply:\n\nThe numeral jeden (1) behaves as an ordinary adjective, and no special rules apply. It can even be used in the plural, for example to mean \"some\" (and not others), or to mean \"one\" with plurale tantum, e.g. jedne drzwi \"one door\" (drzwi has no singular).\nAfter the numerals dwa, trzy, cztery (2, 3, 4), and compound numbers ending with them (22, 23, 24, etc. but not 12, 13, or 14, which take -naście as a suffix and are thus not compound numbers in the first place), the noun is plural and takes the same case as the numeral, and the resulting noun phrase is plural (e.g. 4 koty stały, \"4 cats stood\").\nWith other numbers (5, 6, etc., 20, 21, 25, etc.), if the numeral is nominative or accusative, the noun takes the genitive plural form, and the resulting noun phrase is neuter singular (e.g. 5 kotów stało, \"5 cats stood\").\nWith the masculine personal plural forms of numbers (as given in the morphology article section), the rule given above – that if the numeral is nominative or accusative, the noun is genitive plural and the resulting phrase is neuter singular – applies to all numbers other than 1 (as in trzech mężczyzn przyszło, \"three men came\"), unless the alternative nominative forms dwaj, trzej, czterej (for 2, 3, 4) are used (these take nominative nouns and form a masculine plural phrase).\nIf the numeral is in the genitive, dative, instrumental or locative, the noun takes the same case as the numeral (except sometimes in the case of numbers that end with the nouns for 1000 and higher quantities, which often take a genitive noun regardless since they are treated as normal nouns).\nPolish also has a series of numerals called collective numerals (liczebniki zbiorowe), namely dwoje (for 2), troje (for 3), czworo (for 4), pięcioro (for 5), and so on. These are used with the following types of nouns:\n\nPersonal and animate neuter nouns (e.g. dziecko (\"child\"), kocię (\"kitten\"))\nNon-masculine personal pluralia tantum, i.e. nouns that do not exist in the grammatical singular (such as drzwi (\"door(s)\"), urodziny (\"birthday(s)\"))\nPlural nouns referring to a group containing both sexes (for example, czworo studentów refers to a group of four students of mixed sex)\nFor the declension of collective numerals by case, see the morphology article section. They all follow the rule that when the numeral is nominative or accusative, the noun becomes genitive plural, and the resulting noun phrase is neuter singular. In this case the genitive noun is also used after the instrumental of the numeral.\nCertain quantifiers behave similarly to numerals. These include kilka (\"several\"), parę (\"a few\") and wiele (\"much, many\"), which behave like numbers above 5 in terms of the noun cases and verb forms taken. There are also indefinite numerals kilkanaście, kilkadziesiąt, kilkaset (and similar forms with parę-), meaning \"several-teen\", several tens and several hundred.\nQuantifiers that always take the genitive of nouns include dużo (\"much, many\"), mało (\"few, little\"), więcej (\"more\"), mniej (\"less\") (also najwięcej/najmniej \"most/least\"), trochę (\"a bit\"), pełno (\"plenty, a lot\").\nThe words oba and obydwa (meaning \"both\"), and their derived forms behave like dwa. However the collective forms oboje, obydwoje (in the nominative/vocative), when referring to a married couple or similar, take the nominative form of the noun rather than the genitive, and form a masculine plural noun phrase (oboje rodzice byli, \"both parents were\", cf. dwoje rodziców było).\nFor the declension of all the above quantifiers, see the morphology article section.\n\n\n== Verbs ==\n\nPolish verbs have the grammatical category of aspect. Each verb is either imperfective, meaning that it denotes continuous or habitual events, or perfective, meaning that it denotes single completed events (in particular, perfective verbs have no present tense). Verbs often occur in imperfective and perfective pairs – for example, jeść and zjeść both mean \"to eat\", but the first has imperfective aspect, the second perfective.\nImperfective verbs have three tenses: present, past and future, the last being a compound tense (except in the case of być \"to be\"). Perfective verbs have a past tense and a simple future tense, the latter formed on the same pattern as the present tense of imperfective verbs. Both types also have imperative and conditional forms. The dictionary form of a verb is the infinitive, which usually ends with -ć (occasionally with -c). The present-day past tense derives from the old Slavic \"perfect\" tense; several other old tenses (the aorist, imperfect) have been dropped.\nThe present tense of imperfective verbs (and future tense of perfective verbs) has six forms, for the three persons and two numbers. For example, the present tense of jeść is jem, jesz, je; jemy, jecie, jedzą (meaning \"(I) eat\" etc. – subject pronouns may be dropped), while the future tense of the corresponding perfective verb zjeść is zjem, zjesz etc. (meaning \"(I) shall eat\" etc.)\nThe verb być has the irregular present tense jestem, jesteś, jest, jesteśmy, jesteście, są. It also has a simple future tense (see below).\nThe past tense agrees with the subject in gender as well as person and number. The basic past stem is in -ł; to this are added endings for gender and number, and then personal endings are further added for the first and second person forms. Thus, on the example of być, the past tense forms are byłem/byłam (\"I was\", masc/fem.), byłeś/byłaś, był/była/było; byliśmy/byłyśmy (\"we were\" all gender mixes (except:)/a group of all fem.), byliście/byłyście, byli/były.\nThe conditional is formed from the past tense, by, and the personal ending (if any). For example: byłbym/byłabym (\"I would be\", masc/fem.), byłbyś/byłabyś, byłby/byłaby/byłoby; bylibyśmy/byłybyśmy, bylibyście/byłybyście, byliby/byłyby.\nThe personal past tense suffixes, which are reduced forms of the present tense of być, are clitics and can be detached from the verb to attach to another accented word earlier in the sentence, such as a question word (as in kogoście zobaczyli as an alternative to kogo zobaczyliście \"whom did you see\"), or (mostly in informal speech) an emphatic particle że (co żeście zrobili? \"what did you do\"). The same applies to the conditional endings (kiedy byście przyszli as an alternative to kiedy przyszlibyście \"when would you come\").\nIf by introduces the clause, either alone or forming one of the conjunctions żeby, iżby, ażeby, aby, coby, it forms the subjunctive mood\nand is not to be confused with the conditional clitic by. For example, \"He wants me to sing\" might be chce, aby(m) śpiewał, chce, żeby(m) śpiewał or chce, by(m) śpiewał. Such clauses may express \"in order that\", or be used with verbs meaning \"want\", \"expect\", etc.\nThe future tense of być (\"be\") follows the pattern of a typical present tense: będę, będziesz, będzie, będziemy, będziecie, będą.\nThe future tense of other imperfective verbs is formed using the future of być together with the infinitive, or the past form (inflected for gender and number, but without any personal suffixes), of the verb in question. For example, the future of robić (\"do, make\") has such forms as będę robić/robił/robiła, będziecie robić/robili/robiły. The choice between infinitive and past form is usually a free one, but with modals governing another infinitive, the past form is used: będzie musiał odejść (not będzie musieć...) \"he will have to leave\".\nThe second personal singular imperative is formed from the present tense by dropping the ending (e.g. brać: 2/3S present bierze(sz), imperative bierz), sometimes adding -ij or -aj. Add -my and -cie for the 1P and 2P forms. To make third-person imperative sentences (including with the polite second-person pronouns pan etc.) the particle niech is used at the start of the sentence (or at least before the verb), with the verb in the future tense (if być or perfective) or present tense (otherwise). There is a tendency to prefer imperfective verbs in imperative sentences for politeness; negative imperatives quite rarely use perfectives.\nOther forms of the verb are:\n\npresent adverbial participle (imperfective verbs only), as śpiewając (meaning \"(when) singing\", \"by singing\", etc.)\npresent adjectival participle (imperfective verbs only), formed from the present adverbial participle by adding adjectival endings, as śpiewający etc., meaning \"singing\" (as an attributive adjective), although such participles can be used to form extended adjectival phrases, which (usually unlike in English) can precede the noun.\npassive participle (all transitive verbs), in -ny or -ty (conjugated as an adjective). This often corresponds to the English past participle, both in fully adjectival use and in passive voice.\nsubjectless past tense, formed as the past participle but with the ending -o (e.g. śpiewano \"there was sung\").\npast active participle (perfective verbs only), like zabiwszy \"having killed\" (from zabić \"kill\"); this form is invariant.\nverbal noun, also called gerund, formed from the past participle with the ending -ie, e.g. śpiewanie. This is a neuter noun.\n\n\n== Prepositions ==\nPolish uses prepositions, which form phrases by preceding a noun or noun phrase. Different prepositions take different cases (all cases are possible except nominative and vocative); some prepositions can take different cases depending on meaning.\nThe prepositions z and w are pronounced together with the following word, obeying the usual rules for consonant cluster voicing (so z tobą \"with you\" is pronounced stobą). Before some consonant clusters, particularly clusters beginning with a sibilant (in the case of z) or with f/w (in the case of w), the prepositions take the form ze and we (e.g. we Wrocławiu \"in Wrocław\"). These forms are also used before the first-person singular pronouns in mn-; several other prepositions also have longer forms before these pronouns (przeze mnie, pode mną etc.), and these phrases are pronounced as single words, with the stress on the penultimate syllable (the -e).\nCommon prepositions include:\n\nna, with the locative with basic meaning \"on\", and with the accusative with basic meaning \"onto\" (also metaphorical meanings)\nw, with the locative with basic meaning \"in\", and with the accusative with basic meaning \"into\" (also metaphorical meanings)\nz, with the instrumental comitative meaning \"with\" (in accompaniment of); with the genitive meaning \"from, out of\"\ndo/od, with genitive, meaning \"to, into/from\"\ndla, with genitive, meaning \"for\"\no, with locative meaning \"about\", also with the accusative in some constructions\nprzed/za/nad/pod with instrumental meaning \"before, in front of/behind/over/under\", also with the accusative in some meanings (and genitive in the case of za); there are also compound prepositions sprzed/zza/znad/spod (\"from in front of\" etc.) taking the genitive\nprzez with the accusative, meaning \"through\" etc.\nprzeciw(ko) with dative, meaning \"against\" (but naprzeciw(ko) \"opposite\" takes genitive)\npo, with locative meaning \"after\", also with the accusative in some meanings\nprzy, with locative, meaning \"next to\" etc.\nbez, with genitive, meaning \"without\"\n\n\n== Conjunctions ==\nCommon Polish conjunctions include i (and less commonly oraz) meaning \"and\", lub and albo meaning \"or\", ale meaning \"but\", lecz meaning \"but\" chiefly in phrases of the type \"not x but y\", że (or more formally sometimes iż) meaning \"that\", jeśli meaning \"if\" (also gdyby, where by is the conditional particle), czy meaning \"whether\" (also an interrogative particle), kiedy or gdy meaning \"when\", więc, dlatego and zatem meaning \"so, therefore\", ponieważ meaning \"because\", choć/chociaż meaning \"although\", and aby/żeby meaning \"in order to/that\" (can be followed by an infinitive phrase, or by a sentence in the past tense; in the latter case the by of the conjunction is in fact the conditional particle and takes personal endings as appropriate).\nIn written Polish, subordinate clauses are normally set off with commas. Commas are not normally used before conjunctions meaning \"and\" or \"or\".\n\n\n== Syntax ==\n\n\n=== Word order ===\nBasic word order in Polish is SVO; however, as it is a synthetic language, it is possible to move words around in the sentence. For example, Alicja ma kota (\"Alice has a cat\") is the standard order, but it is also possible to use other orders to give a different emphasis (for example, Alicja kota ma, with emphasis on ma (\"has\"), used as a response to an assertion of the opposite); general word order controls theme and rheme information structure with theme coming first.\nCertain words, however, behave as clitics: they rarely or never begin a clause, but are used after another stressed word, and tend to appear early in the clause. Examples of these are the weak pronouns mi, go etc., the reflexive pronoun się, and the personal past tense endings and conditional endings described under Verbs above.\nPolish is a pro-drop language; subject pronouns are frequently dropped. For example: ma kota (literally \"has a cat\") may mean \"he/she/it has a cat\". It is also possible to drop the object or even sometimes verb, if they are obvious from context. For example, ma (\"has\") or nie ma (\"has not\") may be used as an affirmative or negative answer to a question \"does... have...?\".\nNote the interrogative particle czy, which is used to start a yes–no question, much like the French \"est-ce que\". The particle is not obligatory, and sometimes rising intonation is the only signal of the interrogative character of the sentence.\nNegation is achieved by placing nie directly before the verb, or other word or phrase being negated (in some cases nie- is prefixed to the negated word, equivalent to English un- or non-). If a sentence contains a negative element such as nigdy (\"never\"), nikt (\"no-one\"), etc., the verb is negated with nie as well (and several such negative elements can be combined, as in nikt nigdy nic nie robi, \"no-one ever does anything\", literally \"no-one never doesn't do nothing\").  \nThe equivalent of the English \"there is\" etc. is the appropriate part of the verb być (\"to be\"), e.g. jest... (\"there is...\"), są... (\"there are...\"), był(a/o)... (\"there was...\"), etc., with a noun phrase in the nominative. The negative form is always singular (and neuter where applicable), takes the noun phrase in the genitive, and uses ma rather than jest in the present tense: nie ma kota (\"there isn't a cat\", also \"the cat isn't there\"), nie było kota etc. (as usual, the word order is not fixed).\nWhere two concepts are equated, the particle to is often used instead of a part of być, with the nouns expressing the concepts in the nominative case (although verb infinitives can also be used here: istnieć to cierpieć \"to exist is to suffer\"). There are also sentences where to appears to be the subject of być, but the complement is in the nominative and the verb agrees with the complement: to jest... (\"this/it is...\"), to są..., to był(a/o)..., etc.\n\n\n=== Subjectless sentences ===\nThere are various types of sentence in Polish that do not have subjects:\n\nSentences where the subject pronoun is dropped (see above), but is still understood.\nSentences formed from certain verbs that can appear (in third-person singular neuter form) without a subject, corresponding to an English impersonal \"it\", as in padało (\"it was raining/snowing\").\nSentences with verbs in second-person singular (or sometimes third-person personal plural) form, but no subject, corresponding to English \"you\" with general meaning, as in robisz to (\"you do this\", i.e., \"one does this\").\nSentences with the reflexive particle się but no subject, the verb being third-person singular, as in tutaj pije się wódkę (\"here one drinks vodka/vodka is drunk\") – the logical direct object is in the accusative, not the nominative as in analogous constructions in other languages such as Russian.\nSentences with the subjectless past tense form of the verb (see Verbs above).\nSentences with impersonal particles such as można (\"it is possible\"), wolno (\"it is permitted\").\n\n\n=== Noun syntax ===\nThe use of the cases of nouns is as follows:\n\nThe nominative (the dictionary form of a noun) is used for sentence subject and for certain complements (as in sentences of the form X to Y \"X is Y\", to jest Y \"this is Y\").\nThe accusative is used for the direct object of verbs that are not negated, as the object of some prepositions, and in some time expressions.\nThe genitive is used for possessor and similar (equivalent to English \"of X\" or \"X's\"), for the direct object of negated verbs, as the object of some verbs and prepositions, as an object with partitive meaning and in some fixed expressions, and for nouns governed by certain numbers and expressions of quantity (see Numbers and quantifiers above).\nThe locative is used only as the object of certain prepositions (particularly w \"in\" and na \"on\", when they have static meaning).\nThe dative is used for indirect objects, to denote the party for whom something is done or the \"party concerned\" in certain expressions (such as wolno mu, \"he is allowed\", lit. \"it is allowed to him\"), and as the object of some verbs and prepositions.\nThe instrumental is used for the means (instrument) by which something is done, for example pociągiem (instrumental of pociąg \"train\") means \"by train\". It is also used for a noun complement of być (\"to be\"), and for the complements and objects of some other verbs and some prepositions.\nThe vocative is used to indicate who or what is being addressed. However, with personal names, in colloquial speech, the nominative is usually used instead.\nLike most Slavic languages, with the exception of Bulgarian and Macedonian, Polish classically uses no definite or indefinite articles, though certain words or grammatical features may substitute this, with a shift currently taking place in the language. A noun such as kot may mean either \"the cat\" or \"a cat\", while saying ten kot (lit. \"that cat\") can function similarly to a definite article in other languages. Recent academic research has shown a grammatical shift (not unlike the one which took place in other Indo-European languages, Bulgarian and Macedonian included), where the numeral jeden (\"one\") or pronoun jakiś (\"of sorts\"; different forms depending on the grammatical context) have begun to take characteristics of an indefinite article - an example here could be saying jeden kot (\"one cat\"), which by an increasing number of speakers can be interpreted in a way similar to saying \"a cat\" in English.\nPolish does not regularly place nouns together to form compound noun expressions. Equivalents to such expressions are formed using noun-derived adjectives (as in sok pomarańczowy, \"orange juice\", where pomarańczowy is an adjective derived from pomarańcza \"orange\"), or using prepositional phrases or (equivalently) a noun in the genitive or other case.\nA group of nouns connected by a word for \"and\" is treated as plural. It is masculine personal plural if it contains any male person (in fact, if it contains any person and any masculine noun).\n\n\n=== Adjective syntax ===\nAdjectives generally precede the noun they modify, although in some fixed expressions and official names and phrases they can follow the noun (as in język polski \"Polish language\", rather than polski język; also dzień dobry \"good day, hello\", rather than dobry dzień).\nAttributive adjectives agree in gender, number and case with the noun they modify. Predicate adjectives agree with the relevant noun in gender and number, and are in the nominative case, unless the subject is unspecified (as in some infinitive phrases), in which case the adjective takes the (masculine/neuter) instrumental form (for example, być mądrym, \"to be wise\", although the nominative is used if the logical subject is specified). The instrumental is also used for adjectival complements of some other verbs, as in czynić go mądrym (\"make him wise\").\nWith pronouns such as coś (\"something\") (but not ktoś \"someone\"), if the pronoun is nominative or accusative, the adjective takes the genitive form (coś dobrego \"something good\").\nAdjectives are sometimes used as nouns; for example, zielony (\"green\") may mean \"the/a green one\" etc.\nCompound adjectives can be formed by replacing the ending of the first adjective with -o, as in formalno-prawny (\"formal (and) legal\").\n\n\n== References ==\n\nSoerensen, Asmus (1900). Polnische Grammatik mit grammatisch-alphabetischem Verbalverzeichnis. E. Haberland.\nSadowska, Iwona (2012). Polish: A Comprehensive Grammar. Oxford; New York City: Routledge. ISBN 978-0-415-47541-9.\nPolish Pronunciation Audio and Grammar Charts",
    "url": "https://en.wikipedia.org/wiki/Polish_grammar",
    "related_articles": [
      "Marathi Keertan",
      "Slovene grammar",
      "Persian grammar",
      "Tagalog grammar"
    ]
  },
  "timestamp": 1756970848.2688885
}